# EnableAutoDetect Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSketchComponent..::..EnableAutoDetect Method
AnalyticalModelSketchComponent Class See Also
---
Enables Auto-detect on Sketch Component.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void EnableAutoDetect()
```

Visual Basic
---
```text
Public Sub EnableAutoDetect
```

Visual C++
---
```text
public:
void EnableAutoDetect()
```

# Remarks
To disable Auto-detect on Sketch Component, another method (SetAnalyticalAlignmentMethod) must be used
# See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace